<template>
  <div class="faq">
    <div class="faq__wrapper container">
      <pt-section-title class="faq__title">Часто задаваемые вопросы</pt-section-title>
      <pt-accordion class="faq__accordion" :data-item="items"></pt-accordion>
    </div>
  </div>
</template>

<script setup lang='ts'>
import type { TAccortionItem } from '~/components/ui/Accordion/AccordionTypes'

const items = ref<TAccortionItem[]>([
  {
    title: 'Какие документы нужны для оформления?',
    content: '<ul class=\'list--numbers\'><li>Копия паспорта</li><li>Копия СНИЛС</li><li>Копия Военного билета</li><li>Копия диплома об образовании</li><li>Трудовая книжка, оригинал (при наличии)</li><li>Форма СТД-Р, можно выгрузить на портале Госуслуги</li><li>Фотография 3x4</li></ul><h3>Дополнительно, может понадобится</h3><ul class=\'list--numbers\'><li>Копия ИНН</li><li>Копия Свидетельства о браке</li><li>Копия Свидетельства о рождении ребенка</li><li>Справка 2-НДФЛ</li><li>Реквизиты расчетного счета</li></ul>'
  },
  {
    title: 'Когда выплачивается заработная плата?',
    content: '<p>Заработная плата выплачивается 2-мя частями:</p><ul class=\'list--dots\'><li><strong>29 числа каждого месяца</strong> - часть оклада, в зависимости от того, сколько дней  отработано в первой половине календарного месяца.</li><li><strong>14 числа каждого месяца</strong> - заработная плата за прошлый месяц (оставшаяся часть оклада за месяц и вся премия)</li></ul>'
  },
  {
    title: 'Есть ли система штрафов?',
    content: '<ul class=\'list--dots\'><li>Есть система ошибок, которая влияет на премию, но не на оклад. На период испытательного срока можно ошибаться сколько угодно!</li></ul>'
  },
  {
    title: 'Когда я могу пойти в отпуск?',
    content: '<p>Все сотрудники ходят в отпуск 3 раза в год - один раз на 14 календарных дней, и два раза по 7 календарных дней.</p><p>Согласно графику отпусков, согласно ст.122 и ст.123 ТК РФ.<br>Первый отпуск доступен после 6 месяцев работы, согласно ст.124 ТК РФ.</p><p>Мы всегда стараемся учесть пожелания сотрудников по датам отпусков.</p>'
  },
  {
    title: 'Кем можно стать, работая на складе?',
    content: '<ul class=\'list--dots\'><li>Специалист по рекламациям</li><li>Ревизор</li><li>Координатор склада</li><li>Технический специалист</li><li>Специалист по обучению</li><li>Начальник смены</li><li>Начальник склада</li></ul>'
  },
  {
    title: 'Как проходит обучение сотрудников склада?',
    content: '<ul class=\'list--numbers\'><li>Экскурсия, знакомство с компанией, ознакомление с положение о технике безопасности</li><li>Изучение ориентирования на складе, изучение адресного хранения</li><li>Изучение обязанностей и правил работы с ТСД</li><li>Закрепление основ</li><li>Работа под наблюдением опытного наставника</li><li>Итоговая аттестация</li></ul>'
  }
])
</script>

<style scoped lang='scss'>
@import "assets/styles/functions.scss";

.faq {
  background-color: #F1F4F5;
  padding: 80px 0;

  @media screen and (max-width: 1500px) {
    &__title {
      margin-bottom: vw(40);
    }
  }
  @media screen and (max-width: 468px) {
    padding: vmin(40) 0;
    &__title {
      margin-bottom: vmin(18);
    }
  }
}
</style>